espressif/idf-extra-components/esp_schedule/examples/get_started/sdkconfig.defaults.esp32c2
# ESP32C2 specific

CONFIG_IDF_TARGET="esp32c2"
CONFIG_XTAL_FREQ_26=y